In [21]:
# Import the dependencies.
from sqlalchemy import create_engine
from sqlalchemy import Column, Integer, String, Float
import pandas as pd
from pathlib import Path
from sqlalchemy.ext.declarative import declarative_base
import numpy as np
import datetime as dt



# Create a base class for declarating class definitions to produce Table objects
database_path = Path("./SurfsUp/Resources/hawaii.sqlite")

Part 1: Analyze and Explore the Climate Data

In [2]:
engine = create_engine(f"sqlite:///{database_path}")
conn = engine.connect()

In [3]:
data1 = pd.read_sql("SELECT * FROM station", conn)
data2 = pd.read_sql("SELECT * FROM measurement", conn)

In [4]:
# Preview the Data
data2.head()

   id      station        date  prcp  tobs
0   1  USC00519397  2010-01-01  0.08  65.0
1   2  USC00519397  2010-01-02  0.00  63.0
2   3  USC00519397  2010-01-03  0.00  74.0
3   4  USC00519397  2010-01-04  0.00  76.0
4   5  USC00519397  2010-01-06   NaN  73.0

In [5]:
data_all=pd.merge(data1,data2,how='left',on='station')
data_all.head()

,id_x,station,name,latitude,longitude,elevation,id_y,date,prcp,tobs
0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,1,2010-01-01,0.08,65.0
1,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,2,2010-01-02,0.00,63.0
2,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,3,2010-01-03,0.00,74.0
3,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,4,2010-01-04,0.00,76.0
4,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0,5,2010-01-06,NaN,73.0

In [9]:
#convert date to datetime
data_all['date']=pd.to_datetime(data_all['date'])
data_all.date.apply(lambda x: x.strftime('%Y%m%d')).astype(int)
data_all.dtypes

id_x                  int64
station              object
name                 object
latitude            float64
longitude           float64
elevation           float64
id_y                  int64
date         datetime64[ns]
prcp                float64
tobs                float64
dtype: object

Precipitation Analysis

In [28]:
#Find the most recent date in the dataset.
from natsort import index_natsorted

data_all.sort_values(by='date')
#data_all.head(10)
newest=data_all['date'].loc[data_all.index[-1]]
print(newest)

2017-08-23 00:00:00

In [29]:
#Using that date, get the previous 12 months of precipitation data by querying the previous 12 months of data.
last_year=data_all.iloc

In [ ]:
#Select only the "date" and "prcp" values.

In [ ]:
#Load the query results into a Pandas DataFrame. Explicitly set the column names.

In [ ]:
#Sort the DataFrame values by "date".

In [ ]:
#Plot the results by using the DataFrame plot method, as the following image shows:

Station Analysis

In [ ]:
#Design a query to calculate the total number of stations in the dataset.

In [30]:
#Design a query to find the most-active stations (that is, the stations that have the most rows). To do so, complete the following steps:
#List the stations and observation counts in descending order.
#Answer the following question: which station id has the greatest number of observations?

In [ ]:
#Design a query that calculates the lowest, highest, and average temperatures that filters on the most-active station id found in the previous query.

In [ ]:
#Design a query to get the previous 12 months of temperature observation (TOBS) data. To do so, complete the following steps:
#Plot the results as a histogram with bins=12

Part 2: Design Your Climate App